<template>
  <div class="agreement">
         <TopNav :menu="menutext"/>
    <div class="content">
    <p>
      欢迎使用货搬搬提供的有关服务！
      </p>
          <p>
为正常使用货搬搬及其提供的货物托运居间服务（以下简称“服务”），您应当认真阅读并严格遵守本协议。
    </p><p>
本协议的签署、注册及使用货搬搬软件的前提条件，您使用货搬搬软件的行为将视为您同意接受本协议相关条款。
    </p><p>

一、用户注册
    </p><p>
1.1 为使用搬搬服务，您须在货搬搬应用程序上进行注册并授权开通各项服务，注册时您必须保证提供真实有效的信息，您知晓并同意本协议，您一经成为货搬搬的注册用户，将会默认开通我司服务账户。
    </p><p>
1.2 您应当自行设置账户的密码并妥善保管和管理，不得将其提供给他人使用，如因此造成他人损失，将由您来承担相应责任。
    </p><p>
1.3 如您是代表个人签订本协议，您应具有完全民事行为能力；如您是代表法人实体签订本协议，您应获得授权并遵守本协议并约束该法人实体。
    </p><p>
二、服务内容
    </p><p>
2.1 货搬搬作为网络货运平台为您提供货物运输服务，您在货搬搬平台上发布货物运输需求后，将由货搬搬委托实际承运人完成货物运输服务；向实际承运人提供您通过软件向货搬搬提交的相关信息(包括用户信息、货源信息、起始、终点、车辆信息等其他相关信息和数据)，以供实际承运人接收、选择、査询及抢单；亦包括向您提供实际承运人提交的相关信息(包括司机信息、参与车辆信息、司机及参与车辆的位置、行程路线的信息和数据等)。
    </p><p>
2.2 如果您需要实际承运人向您提供装货、卸货及/或其他额外服务的，为提高服务体验，货搬搬根据市场基本行情制订了搬运费计价标准供您您参考，该标准仅供参考，实际费用应由您与实际承运人协商一致确定。如由此产生的任何形式的争议、纠纷、索赔、责任均与货搬搬无关。
    </p><p>
三、承诺及保证
    </p><p>
您在此不可撤销地作出如下承诺及保证，您充分理解并同意将自行承担因违反下述承诺及保证而造成的全部损失：
    </p><p>
3.1 您为符合相关法律法规规定的、年满十八周岁、并具有完全的民事行为能力和民事权利能力的自然人。
    </p><p>
3.2 本协议规定的义务应是对您合法、有效和有约東力的义务，可以根据本协议的约定对您执行。本协议的订立和履行应不会构成对任何文件、合同或适用法律的违约或违反。
    </p><p>
3.3 您理解货搬搬仅作为网络货运平台为您提供货物运输服务您不得要求实际承运人提供任何形式的非货运服务。本协议中所称“货物”仅指代普通货物，不包含任何形式的危险品、禁运品、赃物等，包括但不限于易燃、易爆、有毒、易传染、放射性物质、易腐蚀、各形式化学试剂、弹药、枪支、管制物、烟火制品、涉及国家机密的文件、仪器、图表器材、麻醉药品、含反动内容就淫秽内容的音像制品、书籍、宣传品及信息载体、毒品、赃物等。
    </p><p>
3.4 您承诺并确认：本人将严格遵守《道路危险货物运输管理规定》及相关道路运法输法律规之规定，不得托运法律法规所禁止运输的货物，不得托运危险品或赃物，对特定的物品需满足特定运输条件时方可托运，同意谨慎遵守《禁限运输货物条款》。
    </p><p>
3.5 您承诺并确认：本人托运货物已根据其实际情况根据国家或行业包装标准进行了妥善地包装，且包装完全符合短途及/或长途运输的基本要求(如：运输时的摩擦、正常刹车时的碰撞、搬运装卸承受力及标志)。
    </p><p>
3.6 您理解并同意注册成为货搬搬个人用户及/或使用货搬搬软件服务的过程中，所发布、提供的所有信息(包括但不限于用户信息、货源信息)均是真实、准确、完整、有效的，且您为该等信息的有权发布、提供方。当货搬搬提出合理需求时，您会提供相关真实有效的身份证明及/或货物证明。您理解并同意有义务持续确保发布、提供的所有信息的真实性、准确性、完整性及有效性。
    </p><p>
3.7 货搬搬有权根据本协议及货搬搬软件已发布的和将更改或发布的各项规则、政策、通知、公告要求及/或国家相关法律法规及有关部门的相关要求，要求您进一步提供相关信息，您应予以积极配合。如您未能积极配合或未能及时提供该等相关信息，货搬搬有权立即暂停或终止向您提供部分或全部有关服务。您同意并确认，若在此情形下您因货搬搬暂停或终止向您提供有关服务而遭受任何损失的，您将自行承担该等损失，货搬搬不承担任何责任。
    </p><p>
四、费用及发票
    </p><p>
您可以通过平台查看实际承运人的收费标准及规则。您理解并同意选择下单及预约的行为视为对上述收费标准及规则的接受。
    </p><p>
您确认、理解并同意本平台仅为您提供中立、独立、免费的第三方信息中介服务，您通过平台支付的费用为运输服务提供方的收入，本平台不负有向您开具发票的义务，如需开具发票可向运输服务提供方联系或联系客服热线协助处理。
    </p><p>
五、第三方链接
    </p><p>
平台上可能保留有第三方网站(或应用程序)或网址的链接及第三方服务，是否访问这些链接或接受第三方服务由您做出決定，货搬搬对于链接上所提供的任何信息、数据、观点、图片、陈述或建议的准确性、完整性、充分性和可靠性不提供承诺或保证。如您决定访问任何与本平台链接的第三方网站或应用程序，其可能带来结果和风险全部自行承担。友情提醒：在接受广告时，请务必仔细询问广告主发布的广告的详情以及时效性。
    </p><p>
六、知识产权
    </p><p>
本平台享有对货搬搬软件的著作权、专利权及其他所有相关知识产权，包括但不限于著作、图片、档案、资料、平台架构、页面画面的安排、页面设计等，未经本平台书面同意，不得且不允许以任何形式侵犯知识产权。您应严格遵守《货搬搬知识产权条款》，如有违反条款中的任一项或多项条款，均会视为您违反本协议，货搬搬有权要求您承担相应的违约责任。

七、终止及违约责任
    </p><p>
7.1 除本协议另有约定之外，您在使用本协议项下货搬搬服务过程中，不得出现下列行为，否则货搬搬有权立即停或终止向您提供有关服务、限制您账户的部分或全部功能、冻结货搬搬个人用户的账户钱包的部分或全部款项、注销您的货搬搬账户、终止本协议，并有权要求您赔偿货搬搬因此而遭受的全部损失并承担相关法律责任：
    </p><p>
(1)利用货搬搬软件对他人造成人身损害及财产损害的行为、违反行业操作规范及其他违反法律法规相关规定及行为、违反行业操作规则及其他反法律法规相关规定及社会公序良俗的行为；
    </p><p>
(2)通过任何手段、以任何方式自行或者委托他人进行虚拟交易、虚拟验证、自买自卖、伪造网络用户真实消费/体验、从事刷单、伪造、仿冒等违背本协议商业目的或违反法律法规的不实行为；
    </p><p>
(3)向本协议以外的第三方泄露货搬搬及货搬搬软件的商业机密，包括但不限于用户信息、规则及政策、交易流水、收费标准、订单运营数据等敏感及专有信息；
    </p><p>
(4)您擅自向任何第三方披露您在货搬搬软件上的用户账号和密码、以任何形式擅自转让或授权他人使用您的用户账号和密码、擅自将经由货搬搬软件获得的订单服务信息转让、倒卖、赠与、分享或以任何方式提供给第三方；
    </p><p>
(5)其他损害货搬搬、货搬搬软件及/或损害用户利益和/或违反法律法规规定、社会公序良俗的行为。
    </p><p>
7.2 您违反本协议项下任何约定的，货搬搬有权立即暂停或终止向您提供有关服务、限制您货搬搬账户部分或全部功能、冻结货搬搬个人用户的账户钱包部分或全部款项、注销您货搬搬账户并有权要求您赔偿货搬搬因此而遭受的全部损失并承担相关法律责任。
    </p><p>
7.3 本协议的终止不影响本协议终止前各方的相关权利和义务，包括但不限于守约方依据本协议向违约方追究相应的违约责任
    </p><p>
7.4 本协议项下任何条款中提及的货搬搬平台及/货搬搬软件遭受的任何损失或全部损失因您未能适当履行货物运输服务交易或您违反本协议而向货搬搬平台以外第三方支付的任何赔偿款项或任何第三方和解而支付的任何款项，货搬搬有权向您追偿，且您承诺向货搬搬全额支付该等款项。
    </p><p>
八、其他
    </p><p>
8.1 本协议受中华人民共和国法律管辖并据其予以解释，且不考虑任何冲突法。甲方与乙方同意在使用本软件过程中发生任何争议时，双方先进行友好协商；协商不成时，任何一方均可依据相关法律的规定向乙方所在地有管辖权的人民法院武汉市汉阳区人民法院提起诉讼。
    </p><p>
8.2 本协议项下的任一条、任一款的约定无论因何种原因被视为废止、无效或不可执行，不影响本协议下其他条及/或款的有效性和可行性。
    </p>
    </div>
  </div>
</template>

<script>
import TopNav from '@/components/topnav.vue'
export default {
  name: 'Agreement',
  components:{
    TopNav
  },
  data(){
    return{
      menutext:'货搬搬用户协议'
    }
  },
  methods:{

  }
}
</script>

<style lang="scss" scoped>
.agreement{
  box-sizing: border-box;
  padding:0 30px;
  display: flex;
  flex-direction: column;
  min-height: 100vh;
  background: #f5f6f7;
  .content{
    border-radius: 20px;
    margin-top:50px;
    font-size: 24px;
    box-sizing: border-box;
    overflow: hidden;
    width:100%;
    background:white;
    min-height: 200px;
    padding:20px;
  }
}
</style>
